Catalogs/скт_Методы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>скт_Методы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.скт_Источники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскиеНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьДляВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.скт_СпособыДоставкиРезультата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.скт_ВариантыФорматовВыгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Аргументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Конвертация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.скт_ПроизвольныеАлгоритмы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подготовка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Алгоритм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.скт_ПроизвольныеАлгоритмы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/скт_СпособыДоставкиРезультата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>скт_СпособыДоставкиРезультата</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Непосредственно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаВКаталог</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/скт_Методы/Forms/ФормаВызоваМетода/Ext/Form/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Параметры.Метод.Пустая() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаАртументов = Аргументы.Выгрузить();
	СтандартныеАргументы = Справочники.скт_Методы.НовыеАргументыВызоваМетода(Параметры.Метод);
	Для Каждого текАргумент Из СтандартныеАргументы Цикл
		НоваяСтрока = ТаблицаАртументов.Добавить();
		НоваяСтрока.Имя = текАргумент.Ключ;
		НоваяСтрока.Значение = текстовоеЗначениеТиповогоАргумента(текАргумент.Ключ, текАргумент.Значение);
	КонецЦикла;
	АргментыМетода = Параметры.Метод.Аргументы.Выгрузить();
	Для Каждого текАргумент Из АргментыМетода Цикл
		НоваяСтрока = ТаблицаАртументов.Добавить();
		НоваяСтрока.Имя = текАргумент.Имя;
		НоваяСтрока.Обязательный = текАргумент.Обязательный;
	КонецЦикла;
	Аргументы.Загрузить(ТаблицаАртументов);
	
	// добавить все возможные базовые параметры

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	Результат = Новый Структура;
	Для Каждого текАргумент Из Аргументы.НайтиСтроки(Новый Структура("Использовать", Истина)) Цикл
		Если текАргумент.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Результат.Вставить(текАргумент.Имя, текАргумент.Значение);
	КонецЦикла;
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАргументы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция текстовоеЗначениеТиповогоАргумента(ИмяАргумента, Значение)

	Если ИмяАргумента = "Формат" Тогда
		Возврат XMLСтрока(Значение);
	ИначеЕсли ИмяАргумента = "Архивировать" Тогда
		Возврат ?(Значение, 1, 0);
	ИначеЕсли ИмяАргумента = "СпособДоставки" Тогда
		Возврат ?(Значение = Перечисления.скт_СпособыДоставкиРезультата.ВыгрузкаВКаталог, 1, 0);
	Иначе
		Возврат Значение;
	КонецЕсли;

КонецФункции // текстовоеЗначениеТиповогоАргумента()


#КонецОбласти
